const roles = {
  '1406910949377441892': 'Лидер',
  '1406911945197490257': 'Саб-Лидер',
  '1406911676736868403': 'Ко-Лидер',
  '1406379733553512589': 'Глава отдела',
  '1428497455498133575': 'Зам. главы отдела',
  '1406556543293456475': 'Адепт',
  '1406556489442660433': 'Ученик',
  '1406556273788584097': 'Неофит',
} as const;

const family = {
  '1406400570486427658': 'Ломбард',
  '1408456259962802239': 'Кимерис',
  '1407000424308801577': 'Дейн',
} as const;

const departments = {
  '1419675712633311232': 'Кадровик',
  '1472675230634741811': 'Помощник кадровиков',
  '1418625335745843210': 'МП',
  '1487560848967733368': 'Помощник МП',
  '1419675953650602178': 'Снабженец',
  '1467474386352082975': 'Помощник снабжения',
  '1442184856061608006': 'PVP',
  '1472675150817263861': 'Помощник PVP',
  '1427325098175631534': 'Педик',
} as const;

const departmentColors = {
  Кадровик: 'blue',
  'Помощник кадровиков': 'geekblue',
  МП: 'purple',
  'Помощник МП': 'magenta',
  Снабженец: 'green',
  'Помощник снабжения': 'cyan',
  PVP: 'red',
  'Помощник PVP': 'volcano',
  Педик: 'pink',
} as const;

export { roles, departments, departmentColors, family };
